#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.lambda_logs["createOrder"]: Refreshing state... [id=/aws/lambda/aristaeus-createOrder-dev]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/aristaeus-api-dev]
aws_cloudwatch_log_group.lambda_logs["getOrder"]: Refreshing state... [id=/aws/lambda/aristaeus-getOrder-dev]
data.aws_region.current: Reading...
aws_cloudwatch_log_group.lambda_logs["getNextOrder"]: Refreshing state... [id=/aws/lambda/aristaeus-getNextOrder-dev]
aws_cloudwatch_log_group.lambda_logs["updateOrderStatus"]: Refreshing state... [id=/aws/lambda/aristaeus-updateOrderStatus-dev]
aws_iam_role.lambda_execution: Refreshing state... [id=aristaeus-lambda-execution-dev]
aws_apigatewayv2_api.main: Refreshing state... [id=6rwhhcbxm6]
aws_cloudwatch_log_group.lambda_logs["adminUpdateOrderStatus"]: Refreshing state... [id=/aws/lambda/aristaeus-adminUpdateOrderStatus-dev]
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.lambda_logs["getIngredients"]: Refreshing state... [id=/aws/lambda/aristaeus-getIngredients-dev]
data.aws_caller_identity.current: Read complete after 0s [id=485813993256]
aws_cloudwatch_log_group.lambda_logs["registerRobot"]: Refreshing state... [id=/aws/lambda/aristaeus-registerRobot-dev]
aws_cloudwatch_log_group.lambda_logs["checkPhone"]: Refreshing state... [id=/aws/lambda/aristaeus-checkPhone-dev]
aws_cloudwatch_log_group.lambda_logs["listOrders"]: Refreshing state... [id=/aws/lambda/aristaeus-listOrders-dev]
aws_cloudwatch_log_group.lambda_logs["robotHeartbeat"]: Refreshing state... [id=/aws/lambda/aristaeus-robotHeartbeat-dev]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_iam_role_policy.lambda_logs: Refreshing state... [id=aristaeus-lambda-execution-dev:aristaeus-lambda-logs-dev]
aws_lambda_function.get_ingredients: Refreshing state... [id=aristaeus-getIngredients-dev]
aws_lambda_function.robot_heartbeat: Refreshing state... [id=aristaeus-robotHeartbeat-dev]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=aristaeus-lambda-execution-dev-20251215162229839800000001]
aws_lambda_function.get_order: Refreshing state... [id=aristaeus-getOrder-dev]
aws_lambda_function.create_order: Refreshing state... [id=aristaeus-createOrder-dev]
aws_lambda_function.admin_update_order_status: Refreshing state... [id=aristaeus-adminUpdateOrderStatus-dev]
aws_lambda_function.list_orders: Refreshing state... [id=aristaeus-listOrders-dev]
aws_lambda_function.update_order_status: Refreshing state... [id=aristaeus-updateOrderStatus-dev]
aws_lambda_function.register_robot: Refreshing state... [id=aristaeus-registerRobot-dev]
aws_lambda_function.check_phone: Refreshing state... [id=aristaeus-checkPhone-dev]
aws_lambda_function.get_next_order: Refreshing state... [id=aristaeus-getNextOrder-dev]
aws_lambda_permission.update_order_status: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.update_order_status: Refreshing state... [id=758qevr]
aws_apigatewayv2_integration.robot_heartbeat: Refreshing state... [id=au4dgwb]
aws_lambda_permission.robot_heartbeat: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.create_order: Refreshing state... [id=cgcydib]
aws_lambda_permission.create_order: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.admin_update_order_status: Refreshing state... [id=un746z3]
aws_lambda_permission.admin_update_order_status: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.get_ingredients: Refreshing state... [id=b7l9mvh]
aws_lambda_permission.get_ingredients: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.list_orders: Refreshing state... [id=2uosr55]
aws_lambda_permission.list_orders: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.register_robot: Refreshing state... [id=qi7if2a]
aws_lambda_permission.register_robot: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.get_order: Refreshing state... [id=qbrlzah]
aws_lambda_permission.get_order: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.check_phone: Refreshing state... [id=8kvbm7n]
aws_lambda_permission.check_phone: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.get_next_order: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.get_next_order: Refreshing state... [id=b1vxfro]
aws_apigatewayv2_route.update_order_status: Refreshing state... [id=bj3s5ps]
aws_apigatewayv2_route.robot_heartbeat: Refreshing state... [id=rnqhuyp]
aws_apigatewayv2_route.create_order: Refreshing state... [id=k1bnydi]
aws_apigatewayv2_route.admin_update_order_status: Refreshing state... [id=aptsdi2]
aws_apigatewayv2_route.get_ingredients: Refreshing state... [id=16ddir1]
aws_apigatewayv2_route.list_orders: Refreshing state... [id=ysp6q4j]
aws_apigatewayv2_route.register_robot: Refreshing state... [id=rk0zp9r]
aws_apigatewayv2_route.get_order: Refreshing state... [id=26s4wb1]
aws_apigatewayv2_route.check_phone: Refreshing state... [id=3od42ug]
aws_apigatewayv2_route.get_next_order: Refreshing state... [id=9fosq1l]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.delete_user will be created
  + resource "aws_apigatewayv2_integration" "delete_user" {
      + api_id                                    = "6rwhhcbxm6"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.delete_user will be created
  + resource "aws_apigatewayv2_route" "delete_user" {
      + api_id             = "6rwhhcbxm6"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "DELETE /api/users"
      + target             = (known after apply)
    }

  # aws_cloudwatch_log_group.lambda_logs["deleteUser"] will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/aristaeus-deleteUser-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "aristaeus"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "aristaeus"
        }
    }

  # aws_lambda_function.admin_update_order_status will be updated in-place
  ~ resource "aws_lambda_function" "admin_update_order_status" {
        id                             = "aristaeus-adminUpdateOrderStatus-dev"
      ~ last_modified                  = "2026-02-21T18:29:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.check_phone will be updated in-place
  ~ resource "aws_lambda_function" "check_phone" {
        id                             = "aristaeus-checkPhone-dev"
      ~ last_modified                  = "2026-02-21T18:29:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.create_order will be updated in-place
  ~ resource "aws_lambda_function" "create_order" {
        id                             = "aristaeus-createOrder-dev"
      ~ last_modified                  = "2026-02-21T18:29:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.delete_user will be created
  + resource "aws_lambda_function" "delete_user" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./../dist/lambda.zip"
      + function_name                  = "aristaeus-deleteUser-dev"
      + handler                        = "handlers/users.deleteUser"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::485813993256:role/aristaeus-lambda-execution-dev"
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Project"     = "aristaeus"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "aristaeus"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DATABASE_URL" = (sensitive value)
              + "NODE_ENV"     = "dev"
            }
        }
    }

  # aws_lambda_function.get_ingredients will be updated in-place
  ~ resource "aws_lambda_function" "get_ingredients" {
        id                             = "aristaeus-getIngredients-dev"
      ~ last_modified                  = "2026-02-21T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.get_next_order will be updated in-place
  ~ resource "aws_lambda_function" "get_next_order" {
        id                             = "aristaeus-getNextOrder-dev"
      ~ last_modified                  = "2026-02-21T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.get_order will be updated in-place
  ~ resource "aws_lambda_function" "get_order" {
        id                             = "aristaeus-getOrder-dev"
      ~ last_modified                  = "2026-02-21T18:29:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.list_orders will be updated in-place
  ~ resource "aws_lambda_function" "list_orders" {
        id                             = "aristaeus-listOrders-dev"
      ~ last_modified                  = "2026-02-21T18:29:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.register_robot will be updated in-place
  ~ resource "aws_lambda_function" "register_robot" {
        id                             = "aristaeus-registerRobot-dev"
      ~ last_modified                  = "2026-02-21T18:30:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.robot_heartbeat will be updated in-place
  ~ resource "aws_lambda_function" "robot_heartbeat" {
        id                             = "aristaeus-robotHeartbeat-dev"
      ~ last_modified                  = "2026-02-21T18:30:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.update_order_status will be updated in-place
  ~ resource "aws_lambda_function" "update_order_status" {
        id                             = "aristaeus-updateOrderStatus-dev"
      ~ last_modified                  = "2026-02-21T18:29:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZYUqmWA0zk0Wrxl4xRLB5f+il+kxR1NsRej53oZzEdQ=" -> "EATNMzXid/dzpnsr4n5a7C4jGYhtbAHud9I3M5hHEVc="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "aristaeus"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.delete_user will be created
  + resource "aws_lambda_permission" "delete_user" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "aristaeus-deleteUser-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:485813993256:6rwhhcbxm6/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 10 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @Darkoyd, Action: `pull_request`*